*&---------------------------------------------------------------------------------------*
*& REPORT zpr_exec_31_bhs.
*&---------------------------------------------------------------------------------------*
*& Nome:zpr_exec_31_bhs
*& Tipo: Report
*& Objetivo: Exercícios de report ALV 3.
*&---------------------------------------------------------------------------------------*

REPORT zpr_exec_31_bhs.

*&-------------------------*
*& INCLUDE
*&-------------------------*
INCLUDE: zpr_exec_31_bhs_top.
INCLUDE: zpr_exec_31_bhs_scr.
INCLUDE: zpr_exec_31_bhs_eve.
INCLUDE: zpr_exec_31_bhs_f01.